platformio/platform-ststm32/misc/svd/STM32H757_CM7.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SDMMC1">
      <name>SDMMC2</name>
      <baseAddress>0x48022400</baseAddress>
    </peripheral>
    <peripheral>
      <name>VREFBUF</name>
      <description>VREFBUF</description>
      <groupName>VREFBUF</groupName>
      <baseAddress>0x58003C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>VREFBUF control and status
          register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>ENVR</name>
              <description>Voltage reference buffer mode enable
              This bit is used to enable the voltage reference
              buffer mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIZ</name>
              <description>High impedance mode This bit controls
              the analog switch to connect or not the VREF+ pin.
              Refer to Table196: VREF buffer modes for the mode
              descriptions depending on ENVR bit
              configuration.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VRR</name>
              <description>Voltage reference buffer
              ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VRS</name>
              <description>Voltage reference scale These bits
              select the value generated by the voltage reference
              buffer. Other: Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>VREFBUF calibration control
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIM</name>
              <description>Trimming code These bits are
              automatically initialized after reset with the
              trimming value stored in the Flash memory during the
              production test. Writing into these bits allows to
              tune the internal reference buffer
              voltage.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>IWDG1</name>
      <description>IWDG</description>
      <groupName>IWDG</groupName>
      <baseAddress>0x58004800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KR</name>
          <displayName>KR</displayName>
          <description>Key register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key value (write only, read 0x0000)
              These bits must be written by software at regular
              intervals with the key value 0xAAAA, otherwise the
              watchdog generates a reset when the counter reaches
              0. Writing the key value 0x5555 to enable access to
              the IWDG_PR, IWDG_RLR and IWDG_WINR registers (see
              Section23.3.6: Register access protection) Writing
              the key value CCCCh starts the watchdog (except if
              the hardware watchdog option is
              selected)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <displayName>PR</displayName>
          <description>Prescaler register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PR</name>
              <description>Prescaler divider These bits are write
              access protected see Section23.3.6: Register access
              protection. They are written by software to select
              the prescaler divider feeding the counter clock. PVU
              bit of IWDG_SR must be reset in order to be able to
              change the prescaler divider. Note: Reading this
              register returns the prescaler value from the VDD
              voltage domain. This value may not be up to
              date/valid if a write operation to this register is
              ongoing. For this reason the value read from this
              register is valid only when the PVU bit in the
              IWDG_SR register is reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <displayName>RLR</displayName>
          <description>Reload register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>RL</name>
              <description>Watchdog counter reload value These bits
              are write access protected see Section23.3.6. They
              are written by software to define the value to be
              loaded in the watchdog counter each time the value
              0xAAAA is written in the IWDG_KR register. The
              watchdog counter counts down from this value. The
              timeout period is a function of this value and the
              clock prescaler. Refer to the datasheet for the
              timeout information. The RVU bit in the IWDG_SR
              register must be reset in order to be able to change
              the reload value. Note: Reading this register returns
              the reload value from the VDD voltage domain. This
              value may not be up to date/valid if a write
              operation to this register is ongoing on this
              register. For this reason the value read from this
              register is valid only when the RVU bit in the
              IWDG_SR register is reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Status register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PVU</name>
              <description>Watchdog prescaler value update This bit
              is set by hardware to indicate that an update of the
              prescaler value is ongoing. It is reset by hardware
              when the prescaler update operation is completed in
              the VDD voltage domain (takes up to 5 RC 40 kHz
              cycles). Prescaler value can be updated only when PVU
              bit is reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RVU</name>
              <description>Watchdog counter reload value update
              This bit is set by hardware to indicate that an
              update of the reload value is ongoing. It is reset by
              hardware when the reload value update operation is
              completed in the VDD voltage domain (takes up to 5 RC
              40 kHz cycles). Reload value can be updated only when
              RVU bit is reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WVU</name>
              <description>Watchdog counter window value update
              This bit is set by hardware to indicate that an
              update of the window value is ongoing. It is reset by
              hardware when the reload value update operation is
              completed in the VDD voltage domain (takes up to 5 RC
              40 kHz cycles). Window value can be updated only when
              WVU bit is reset. This bit is generated only if
              generic window = 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WINR</name>
          <displayName>WINR</displayName>
          <description>Window register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>WIN</name>
              <description>Watchdog counter window value These bits
              are write access protected see Section23.3.6. These
              bits contain the high limit of the window value to be
              compared to the downcounter. To prevent a reset, the
              downcounter must be reloaded when its value is lower
              than the window register value and greater than 0x0
              The WVU bit in the IWDG_SR register must be reset in
              order to be able to change the reload value. Note:
              Reading this register returns the reload value from
              the VDD voltage domain. This value may not be valid
              if a write operation to this register is ongoing. For
              this reason the value read from this register is
              valid only when the WVU bit in the IWDG_SR register
              is reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
