platformio/platform-ststm32/misc/svd/STM32H757_CM7.svd
        <register>
          <name>BOOT_PRGR</name>
          <displayName>BOOT_PRGR</displayName>
          <description>FLASH register with boot
          address</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT_ADD0</name>
              <description>Boot address 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BOOT_ADD1</name>
              <description>Boot address 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCR1</name>
          <displayName>CRCCR1</displayName>
          <description>FLASH CRC control register for bank
          1</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_SECT</name>
              <description>Bank 1 CRC sector number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ALL_BANK</name>
              <description>Bank 1 CRC select bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_BY_SECT</name>
              <description>Bank 1 CRC sector mode select
              bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADD_SECT</name>
              <description>Bank 1 CRC sector select
              bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAN_SECT</name>
              <description>Bank 1 CRC sector list clear
              bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START_CRC</name>
              <description>Bank 1 CRC start bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAN_CRC</name>
              <description>Bank 1 CRC clear bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_BURST</name>
              <description>Bank 1 CRC burst size</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCSADD1R</name>
          <displayName>CRCSADD1R</displayName>
          <description>FLASH CRC start address register for bank
          1</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_START_ADDR</name>
              <description>CRC start address on bank
              1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCEADD1R</name>
          <displayName>CRCEADD1R</displayName>
          <description>FLASH CRC end address register for bank
          1</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_END_ADDR</name>
              <description>CRC end address on bank 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCDATAR</name>
          <displayName>CRCDATAR</displayName>
          <description>FLASH CRC data register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_DATA</name>
              <description>CRC result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_FA1R</name>
          <displayName>ECC_FA1R</displayName>
          <description>FLASH ECC fail address for bank
          1</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FAIL_ECC_ADDR1</name>
              <description>Bank 1 ECC error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR2</name>
          <displayName>KEYR2</displayName>
          <description>FLASH key register for bank 2</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEYR2</name>
              <description>Bank 2 access configuration unlock
              key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>FLASH control register for bank
          2</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOCK2</name>
              <description>Bank 2 configuration lock
              bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PG2</name>
              <description>Bank 2 program enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SER2</name>
              <description>Bank 2 sector erase
              request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BER2</name>
              <description>Bank 2 erase request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSIZE2</name>
              <description>Bank 2 program size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FW2</name>
              <description>Bank 2 write forcing control
              bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START2</name>
              <description>Bank 2 bank or sector erase start
              control bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SNB2</name>
              <description>Bank 2 sector erase selection
              number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CRC_EN</name>
              <description>Bank 2 CRC control bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOPIE2</name>
              <description>Bank 2 end-of-program interrupt control
              bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRPERRIE2</name>
              <description>Bank 2 write protection error interrupt
              enable bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGSERRIE2</name>
              <description>Bank 2 programming sequence error
              interrupt enable bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STRBERRIE2</name>
              <description>Bank 2 strobe error interrupt enable
              bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INCERRIE2</name>
              <description>Bank 2 inconsistency error interrupt
              enable bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPERRIE2</name>
              <description>Bank 2 write/erase error interrupt
              enable bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDPERRIE2</name>
              <description>Bank 2 read protection error interrupt
              enable bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDSERRIE2</name>
              <description>Bank 2 secure error interrupt enable
              bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SNECCERRIE2</name>
              <description>Bank 2 ECC single correction error
              interrupt enable bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBECCERRIE2</name>
              <description>Bank 2 ECC double detection error
              interrupt enable bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCENDIE2</name>
              <description>Bank 2 end of CRC calculation interrupt
              enable bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <displayName>SR2</displayName>
          <description>FLASH status register for bank
          2</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BSY2</name>
              <description>Bank 2 ongoing program
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WBNE2</name>
              <description>Bank 2 write buffer not empty
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QW2</name>
              <description>Bank 2 wait queue flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_BUSY2</name>
              <description>Bank 2 CRC busy flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOP2</name>
              <description>Bank 2 end-of-program flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRPERR2</name>
              <description>Bank 2 write protection error
              flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGSERR2</name>
              <description>Bank 2 programming sequence error
              flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STRBERR2</name>
              <description>Bank 2 strobe error flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INCERR2</name>
              <description>Bank 2 inconsistency error
              flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPERR2</name>
              <description>Bank 2 write/erase error
              flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDPERR2</name>
              <description>Bank 2 read protection error
              flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDSERR2</name>
              <description>Bank 2 secure error flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SNECCERR2</name>
              <description>Bank 2 single correction error
              flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBECCERR2</name>
              <description>Bank 2 ECC double detection error
              flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCEND2</name>
              <description>Bank 2 CRC-complete flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <displayName>CCR2</displayName>
          <description>FLASH clear control register for bank
          2</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLR_EOP2</name>
              <description>Bank 1 EOP1 flag clear bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_WRPERR2</name>
              <description>Bank 2 WRPERR1 flag clear
              bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_PGSERR2</name>
              <description>Bank 2 PGSERR1 flag clear
              bi</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_STRBERR2</name>
              <description>Bank 2 STRBERR1 flag clear
              bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_INCERR2</name>
              <description>Bank 2 INCERR1 flag clear
              bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_OPERR2</name>
              <description>Bank 2 OPERR1 flag clear
              bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_RDPERR2</name>
              <description>Bank 2 RDPERR1 flag clear
              bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_RDSERR1</name>
              <description>Bank 1 RDSERR1 flag clear
              bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_SNECCERR2</name>
              <description>Bank 2 SNECCERR1 flag clear
              bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_DBECCERR1</name>
              <description>Bank 1 DBECCERR1 flag clear
              bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_CRCEND2</name>
              <description>Bank 2 CRCEND1 flag clear
              bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRAR_CUR2</name>
          <displayName>PRAR_CUR2</displayName>
          <description>FLASH protection address for bank
          1</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROT_AREA_START2</name>
              <description>Bank 2 lowest PCROP protected
              address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>PROT_AREA_END2</name>
              <description>Bank 2 highest PCROP protected
              address</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DMEP2</name>
              <description>Bank 2 PCROP protected erase enable
              option status bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRAR_PRG2</name>
          <displayName>PRAR_PRG2</displayName>
          <description>FLASH protection address for bank
          2</description>
          <alternateRegister>PRAR_PRG1</alternateRegister>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROT_AREA_START2</name>
              <description>Bank 2 lowest PCROP protected address
              configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>PROT_AREA_END2</name>
              <description>Bank 2 highest PCROP protected address
              configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DMEP2</name>
              <description>Bank 2 PCROP protected erase enable
              option configuration bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAR_CUR2</name>
          <displayName>SCAR_CUR2</displayName>
          <description>FLASH secure address for bank
          2</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEC_AREA_START2</name>
              <description>Bank 2 lowest secure protected
              address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>SEC_AREA_END2</name>
              <description>Bank 2 highest secure protected
              address</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DMES2</name>
              <description>Bank 2 secure protected erase enable
              option status bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAR_PRG2</name>
          <displayName>SCAR_PRG2</displayName>
          <description>FLASH secure address for bank
          2</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEC_AREA_START2</name>
              <description>Bank 2 lowest secure protected address
              configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>SEC_AREA_END2</name>
              <description>Bank 2 highest secure protected address
              configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DMES2</name>
              <description>Bank 2 secure protected erase enable
              option configuration bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSN_CUR2R</name>
          <displayName>WPSN_CUR2R</displayName>
          <description>FLASH write sector protection for bank
          2</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRPSn2</name>
              <description>Bank 2 sector write protection option
              status byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
